Environment: prod. Pipeline Stage: prod
Plan has been truncated:
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_resource_group.app will be created
  + resource "azurerm_resource_group" "app" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-xwc-app-001"
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-1"] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
        id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Resources/deployments/xwc-cloud-agent-1"
        name                = "xwc-cloud-agent-1"
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - resources      = [
                  - {
                      - apiVersion = "2019-06-01"
                      - name       = "auto-xwc-core-001/xwc-cloud-agent-1"
                      - properties = {
                          - scheduleInfo        = {
                              - advancedSchedule = {
                                  - monthlyOccurrences = [
                                      - {
                                          - day        = "Saturday"
                                          - occurrence = "2"
                                        },
                                    ]
                                }
                              - frequency        = "Month"
                              - interval         = "1"
                              - startTime        = "2022-01-12T01:00:00Z"
                              - timeZone         = "UTC"
                            }
                          - updateConfiguration = {
                              - azureVirtualMachines  = []
                              - duration              = "PT2H"
                              - nonAzureComputerNames = []
                              - operatingSystem       = "windows"
                              - targets               = {
                                  - azureQueries    = [
                                      - {
                                          - locations   = []
                                          - scope       = [
                                              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001",
                                            ]
                                          - tagSettings = {
                                              - filterOperator = "All"
                                              - tags           = {
                                                  - UpdateClass = [
                                                      - "Gold1",
                                                    ]
                                                }
                                            }
                                        },
                                    ]
                                  - nonAzureQueries = []
                                }
                              - windows               = {
                                  - excludedKbNumbers             = []
                                  - includedUpdateClassifications = "Critical, Security, UpdateRollup, ServicePack, Definition, Updates"
                                  - rebootSetting                 = "IfRequired"
                                }
                            }
                        }
                      - type       = "Microsoft.Automation/automationAccounts/softwareUpdateConfigurations"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-2"] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
        id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Resources/deployments/xwc-cloud-agent-2"
        name                = "xwc-cloud-agent-2"
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - resources      = [
                  - {
                      - apiVersion = "2019-06-01"
                      - name       = "auto-xwc-core-001/xwc-cloud-agent-2"
                      - properties = {
                          - scheduleInfo        = {
                              - advancedSchedule = {
                                  - monthlyOccurrences = [
                                      - {
                                          - day        = "Saturday"
                                          - occurrence = "3"
                                        },
                                    ]
                                }
                              - frequency        = "Month"
                              - interval         = "1"
                              - startTime        = "2022-01-12T01:00:00Z"
                              - timeZone         = "UTC"
                            }
                          - updateConfiguration = {
                              - azureVirtualMachines  = []
                              - duration              = "PT2H"
                              - nonAzureComputerNames = []
                              - operatingSystem       = "windows"
                              - targets               = {
                                  - azureQueries    = [
                                      - {
                                          - locations   = []
                                          - scope       = [
                                              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001",
                                            ]
                                          - tagSettings = {
                                              - filterOperator = "All"
                                              - tags           = {
                                                  - UpdateClass = [
                                                      - "Gold2",
                                                    ]
                                                }
                                            }
                                        },
                                    ]
                                  - nonAzureQueries = []
                                }
                              - windows               = {
                                  - excludedKbNumbers             = []
                                  - includedUpdateClassifications = "Critical, Security, UpdateRollup, ServicePack, Definition, Updates"
                                  - rebootSetting                 = "IfRequired"
                                }
                            }
                        }
                      - type       = "Microsoft.Automation/automationAccounts/softwareUpdateConfigurations"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-test"] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
        id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Resources/deployments/xwc-cloud-agent-test"
        name                = "xwc-cloud-agent-test"
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - resources      = [
                  - {
                      - apiVersion = "2019-06-01"
                      - name       = "auto-xwc-core-001/xwc-cloud-agent-test"
                      - properties = {
                          - scheduleInfo        = {
                              - advancedSchedule = {
                                  - monthlyOccurrences = [
                                      - {
                                          - day        = "Saturday"
                                          - occurrence = "1"
                                        },
                                    ]
                                }
                              - frequency        = "Month"
                              - interval         = "1"
                              - startTime        = "2022-01-12T01:00:00Z"
                              - timeZone         = "UTC"
                            }
                          - updateConfiguration = {
                              - azureVirtualMachines  = []
                              - duration              = "PT2H"
                              - nonAzureComputerNames = []
                              - operatingSystem       = "windows"
                              - targets               = {
                                  - azureQueries    = [
                                      - {
                                          - locations   = []
                                          - scope       = [
                                              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001",
                                            ]
                                          - tagSettings = {
                                              - filterOperator = "All"
                                              - tags           = {
                                                  - UpdateClass = [
                                                      - "test",
                                                    ]
                                                }
                                            }
                                        },
                                    ]
                                  - nonAzureQueries = []
                                }
                              - windows               = {
                                  - excludedKbNumbers             = []
                                  - includedUpdateClassifications = "Critical, Security, UpdateRollup, ServicePack, Definition, Updates"
                                  - rebootSetting                 = "IfRequired"
                                }
                            }
                        }
                      - type       = "Microsoft.Automation/automationAccounts/softwareUpdateConfigurations"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-device-manager"] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
        id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Resources/deployments/xwc-device-manager"
        name                = "xwc-device-manager"
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - resources      = [
                  - {
                      - apiVersion = "2019-06-01"
                      - name       = "auto-xwc-core-001/xwc-device-manager"
                      - properties = {
                          - scheduleInfo        = {
                              - advancedSchedule = {
                                  - monthlyOccurrences = [
                                      - {
                                          - day        = "Saturday"
                                          - occurrence = "2"
                                        },
                                    ]
                                }
                              - frequency        = "Month"
                              - interval         = "1"
                              - startTime        = "2022-01-12T01:00:00Z"
                              - timeZone         = "UTC"
                            }
                          - updateConfiguration = {
                              - azureVirtualMachines  = []
                              - duration              = "PT2H"
                              - nonAzureComputerNames = []
                              - operatingSystem       = "windows"
                              - targets               = {
                                  - azureQueries    = [
                                      - {
                                          - locations   = []
                                          - scope       = [
                                              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001",
                                            ]
                                          - tagSettings = {
                                              - filterOperator = "All"
                                              - tags           = {
                                                  - UpdateClass = [
                                                      - "Gold1",
                                                    ]
                                                }
                                            }
                                        },
                                    ]
                                  - nonAzureQueries = []
                                }
                              - windows               = {
                                  - excludedKbNumbers             = []
                                  - includedUpdateClassifications = "Critical, Security, UpdateRollup, ServicePack, Definition, Updates"
                                  - rebootSetting                 = "IfRequired"
                                }
                            }
                        }
                      - type       = "Microsoft.Automation/automationAccounts/softwareUpdateConfigurations"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-device-manager-test"] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
        id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Resources/deployments/xwc-device-manager-test"
        name                = "xwc-device-manager-test"
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - resources      = [
                  - {
                      - apiVersion = "2019-06-01"
                      - name       = "auto-xwc-core-001/xwc-device-manager-test"
                      - properties = {
                          - scheduleInfo        = {
                              - advancedSchedule = {
                                  - monthlyOccurrences = [
                                      - {
                                          - day        = "Saturday"
                                          - occurrence = "1"
                                        },
                                    ]
                                }
                              - frequency        = "Month"
                              - interval         = "1"
                              - startTime        = "2022-01-12T01:00:00Z"
                              - timeZone         = "UTC"
                            }
                          - updateConfiguration = {
                              - azureVirtualMachines  = []
                              - duration              = "PT2H"
                              - nonAzureComputerNames = []
                              - operatingSystem       = "windows"
                              - targets               = {
                                  - azureQueries    = [
                                      - {
                                          - locations   = []
                                          - scope       = [
                                              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001",
                                            ]
                                          - tagSettings = {
                                              - filterOperator = "All"
                                              - tags           = {
                                                  - UpdateClass = [
                                                      - "test",
                                                    ]
                                                }
                                            }
                                        },
                                    ]
                                  - nonAzureQueries = []
                                }
                              - windows               = {
                                  - excludedKbNumbers             = []
                                  - includedUpdateClassifications = "Critical, Security, UpdateRollup, ServicePack, Definition, Updates"
                                  - rebootSetting                 = "IfRequired"
                                }
                            }
                        }
                      - type       = "Microsoft.Automation/automationAccounts/softwareUpdateConfigurations"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca01"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca01/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca01" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca01" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca02"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca02/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca02" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca02" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca03"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca03/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca03" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca03" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca04"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca04/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca04" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca04" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca05"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca05/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca05" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca05" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca06"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca06/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca06" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca06" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca07"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca07/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca07" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca07" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca08"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca08/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca08" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca08" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca09"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca09/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca09" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca09" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca10"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca10/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca10" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca10" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca11"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca11/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca11" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca11" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca12"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca12/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca12" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca12" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwctestca01"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwctestca01/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwctestca01" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca01" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwctestca02"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwctestca02/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwctestca02" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca02" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca01"] must be replaced
-/+ resource "azurerm_lb" "load_balancer" {
      ~ id                   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01" -> (known after apply)
        name                 = "lbxwcca01"
      ~ private_ip_address   = "10.192.30.4" -> (known after apply)
      ~ private_ip_addresses = [
          - "10.192.30.4",
        ] -> (known after apply)
      ~ resource_group_name  = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                 = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (3 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          ~ availability_zone                                  = "Zone-Redundant" -> (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/frontendIPConfigurations/fe-lbxwcca01" -> (known after apply)
          ~ inbound_nat_rules                                  = [] -> (known after apply)
          ~ load_balancer_rules                                = [
              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/loadBalancingRules/rule-3389-lbxwcca01",
            ] -> (known after apply)
            name                                               = "fe-lbxwcca01"
          ~ outbound_rules                                     = [] -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
          ~ private_ip_address_version                         = "IPv4" -> (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          ~ zones                                              = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca02"] must be replaced
-/+ resource "azurerm_lb" "load_balancer" {
      ~ id                   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca02" -> (known after apply)
        name                 = "lbxwcca02"
      ~ private_ip_address   = "10.192.30.7" -> (known after apply)
      ~ private_ip_addresses = [
          - "10.192.30.7",
        ] -> (known after apply)
      ~ resource_group_name  = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                 = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (3 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          ~ availability_zone                                  = "Zone-Redundant" -> (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/frontendIPConfigurations/fe-lbxwcca02" -> (known after apply)
          ~ inbound_nat_rules                                  = [] -> (known after apply)
          ~ load_balancer_rules                                = [
              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/loadBalancingRules/rule-3389-lbxwcca02",
            ] -> (known after apply)
            name                                               = "fe-lbxwcca02"
          ~ outbound_rules                                     = [] -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
          ~ private_ip_address_version                         = "IPv4" -> (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          ~ zones                                              = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca03"] must be replaced
-/+ resource "azurerm_lb" "load_balancer" {
      ~ id                   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca03" -> (known after apply)
        name                 = "lbxwcca03"
      ~ private_ip_address   = "10.192.30.10" -> (known after apply)
      ~ private_ip_addresses = [
          - "10.192.30.10",
        ] -> (known after apply)
      ~ resource_group_name  = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                 = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (3 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          ~ availability_zone                                  = "Zone-Redundant" -> (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/frontendIPConfigurations/fe-lbxwcca03" -> (known after apply)
          ~ inbound_nat_rules                                  = [] -> (known after apply)
          ~ load_balancer_rules                                = [
              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/loadBalancingRules/rule-3389-lbxwcca03",
            ] -> (known after apply)
            name                                               = "fe-lbxwcca03"
          ~ outbound_rules                                     = [] -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
          ~ private_ip_address_version                         = "IPv4" -> (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          ~ zones                                              = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca04"] must be replaced
-/+ resource "azurerm_lb" "load_balancer" {
      ~ id                   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca04" -> (known after apply)
        name                 = "lbxwcca04"
      ~ private_ip_address   = "10.192.30.13" -> (known after apply)
      ~ private_ip_addresses = [
          - "10.192.30.13",
        ] -> (known after apply)
      ~ resource_group_name  = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                 = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (3 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          ~ availability_zone                                  = "Zone-Redundant" -> (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/frontendIPConfigurations/fe-lbxwcca04" -> (known after apply)
          ~ inbound_nat_rules                                  = [] -> (known after apply)
          ~ load_balancer_rules                                = [
              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/loadBalancingRules/rule-3389-lbxwcca04",
            ] -> (known after apply)
            name                                               = "fe-lbxwcca04"
          ~ outbound_rules                                     = [] -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
          ~ private_ip_address_version                         = "IPv4" -> (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          ~ zones                                              = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca05"] must be replaced
-/+ resource "azurerm_lb" "load_balancer" {
      ~ id                   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca05" -> (known after apply)
        name                 = "lbxwcca05"
      ~ private_ip_address   = "10.192.30.16" -> (known after apply)
      ~ private_ip_addresses = [
          - "10.192.30.16",
        ] -> (known after apply)
      ~ resource_group_name  = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                 = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (3 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          ~ availability_zone                                  = "Zone-Redundant" -> (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/frontendIPConfigurations/fe-lbxwcca05" -> (known after apply)
          ~ inbound_nat_rules                                  = [] -> (known after apply)
          ~ load_balancer_rules                                = [
              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/loadBalancingRules/rule-3389-lbxwcca05",
            ] -> (known after apply)
            name                                               = "fe-lbxwcca05"
          ~ outbound_rules                                     = [] -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
          ~ private_ip_address_version                         = "IPv4" -> (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          ~ zones                                              = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca06"] must be replaced
-/+ resource "azurerm_lb" "load_balancer" {
      ~ id                   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca06" -> (known after apply)
        name                 = "lbxwcca06"
      ~ private_ip_address   = "10.192.30.19" -> (known after apply)
      ~ private_ip_addresses = [
          - "10.192.30.19",
        ] -> (known after apply)
      ~ resource_group_name  = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                 = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (3 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          ~ availability_zone                                  = "Zone-Redundant" -> (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca06/frontendIPConfigurations/fe-lbxwcca06" -> (known after apply)
          ~ inbound_nat_rules                                  = [] -> (known after apply)
          ~ load_balancer_rules                                = [
              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca06/loadBalancingRules/rule-3389-lbxwcca06",
            ] -> (known after apply)
            name                                               = "fe-lbxwcca06"
          ~ outbound_rules                                     = [] -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
          ~ private_ip_address_version                         = "IPv4" -> (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          ~ zones                                              = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwctestca01"] must be replaced
-/+ resource "azurerm_lb" "load_balancer" {
      ~ id                   = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01" -> (known after apply)
        name                 = "lbxwctestca01"
      ~ private_ip_address   = "10.192.30.132" -> (known after apply)
      ~ private_ip_addresses = [
          - "10.192.30.132",
        ] -> (known after apply)
      ~ resource_group_name  = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                 = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (3 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          ~ availability_zone                                  = "Zone-Redundant" -> (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/frontendIPConfigurations/fe-lbxwctestca01" -> (known after apply)
          ~ inbound_nat_rules                                  = [] -> (known after apply)
          ~ load_balancer_rules                                = [
              - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/loadBalancingRules/rule-3389-lbxwctestca01",
            ] -> (known after apply)
            name                                               = "fe-lbxwctestca01"
          ~ outbound_rules                                     = [] -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
          ~ private_ip_address_version                         = "IPv4" -> (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          ~ zones                                              = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca01"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool" "backend_pool" {
      ~ backend_ip_configurations = [] -> (known after apply)
      ~ id                        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01" -> (known after apply)
      ~ load_balancing_rules      = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/loadBalancingRules/rule-3389-lbxwcca01",
        ] -> (known after apply)
      ~ loadbalancer_id           = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01" -> (known after apply) # forces replacement
        name                      = "be-lbxwcca01"
      ~ outbound_rules            = [] -> (known after apply)
      ~ resource_group_name       = "rg-xwc-core-001" -> (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca02"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool" "backend_pool" {
      ~ backend_ip_configurations = [] -> (known after apply)
      ~ id                        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/backendAddressPools/be-lbxwcca02" -> (known after apply)
      ~ load_balancing_rules      = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/loadBalancingRules/rule-3389-lbxwcca02",
        ] -> (known after apply)
      ~ loadbalancer_id           = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca02" -> (known after apply) # forces replacement
        name                      = "be-lbxwcca02"
      ~ outbound_rules            = [] -> (known after apply)
      ~ resource_group_name       = "rg-xwc-core-001" -> (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca03"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool" "backend_pool" {
      ~ backend_ip_configurations = [] -> (known after apply)
      ~ id                        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/backendAddressPools/be-lbxwcca03" -> (known after apply)
      ~ load_balancing_rules      = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/loadBalancingRules/rule-3389-lbxwcca03",
        ] -> (known after apply)
      ~ loadbalancer_id           = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca03" -> (known after apply) # forces replacement
        name                      = "be-lbxwcca03"
      ~ outbound_rules            = [] -> (known after apply)
      ~ resource_group_name       = "rg-xwc-core-001" -> (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca04"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool" "backend_pool" {
      ~ backend_ip_configurations = [] -> (known after apply)
      ~ id                        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/backendAddressPools/be-lbxwcca04" -> (known after apply)
      ~ load_balancing_rules      = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/loadBalancingRules/rule-3389-lbxwcca04",
        ] -> (known after apply)
      ~ loadbalancer_id           = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca04" -> (known after apply) # forces replacement
        name                      = "be-lbxwcca04"
      ~ outbound_rules            = [] -> (known after apply)
      ~ resource_group_name       = "rg-xwc-core-001" -> (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca05"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool" "backend_pool" {
      ~ backend_ip_configurations = [] -> (known after apply)
      ~ id                        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/backendAddressPools/be-lbxwcca05" -> (known after apply)
      ~ load_balancing_rules      = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/loadBalancingRules/rule-3389-lbxwcca05",
        ] -> (known after apply)
      ~ loadbalancer_id           = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca05" -> (known after apply) # forces replacement
        name                      = "be-lbxwcca05"
      ~ outbound_rules            = [] -> (known after apply)
      ~ resource_group_name       = "rg-xwc-core-001" -> (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca06"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool" "backend_pool" {
      ~ backend_ip_configurations = [] -> (known after apply)
      ~ id                        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca06/backendAddressPools/be-lbxwcca06" -> (known after apply)
      ~ load_balancing_rules      = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca06/loadBalancingRules/rule-3389-lbxwcca06",
        ] -> (known after apply)
      ~ loadbalancer_id           = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca06" -> (known after apply) # forces replacement
        name                      = "be-lbxwcca06"
      ~ outbound_rules            = [] -> (known after apply)
      ~ resource_group_name       = "rg-xwc-core-001" -> (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwctestca01"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool" "backend_pool" {
      ~ backend_ip_configurations = [] -> (known after apply)
      ~ id                        = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/backendAddressPools/be-lbxwctestca01" -> (known after apply)
      ~ load_balancing_rules      = [
          - "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/loadBalancingRules/rule-3389-lbxwctestca01",
        ] -> (known after apply)
      ~ loadbalancer_id           = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01" -> (known after apply) # forces replacement
        name                      = "be-lbxwctestca01"
      ~ outbound_rules            = [] -> (known after apply)
      ~ resource_group_name       = "rg-xwc-core-001" -> (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca01"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01/addresses/be-pool-ip-vmxwcca01" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca01"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca02"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01/addresses/be-pool-ip-vmxwcca02" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca02"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca03"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/backendAddressPools/be-lbxwcca02" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/backendAddressPools/be-lbxwcca02/addresses/be-pool-ip-vmxwcca03" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca03"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca04"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/backendAddressPools/be-lbxwcca02" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca02/backendAddressPools/be-lbxwcca02/addresses/be-pool-ip-vmxwcca04" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca04"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca05"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/backendAddressPools/be-lbxwcca03" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/backendAddressPools/be-lbxwcca03/addresses/be-pool-ip-vmxwcca05" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca05"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca06"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/backendAddressPools/be-lbxwcca03" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca03/backendAddressPools/be-lbxwcca03/addresses/be-pool-ip-vmxwcca06" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca06"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca07"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/backendAddressPools/be-lbxwcca04" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/backendAddressPools/be-lbxwcca04/addresses/be-pool-ip-vmxwcca07" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca07"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca08"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/backendAddressPools/be-lbxwcca04" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca04/backendAddressPools/be-lbxwcca04/addresses/be-pool-ip-vmxwcca08" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca08"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca09"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/backendAddressPools/be-lbxwcca05" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/backendAddressPools/be-lbxwcca05/addresses/be-pool-ip-vmxwcca09" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca09"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca10"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca05/backendAddressPools/be-lbxwcca05" -> (known after apply) # forces